//
//  ContentView.swift
//  StoreSwiftUI
//
//  Created by sss on 19.04.2023.
//

import SwiftUI

struct ContentView: View {
    
    @State private var segmentedIndex = 0
    @State var offsetX = 0
    
    var name = ["Кроссовки Nike W Air Huarache", "Кроссовки NIKE REACT INFINITY RUN FLYKNIT 3", "Кроссовки REEBOK TURBO RESTYLE"]
    var description = ["Модель Nike Air Huarache возвращает вам популярность на уличном уровне. Гладкая кожа на верхней части сочетается с супер-дышащей, идеально блестящей неопреновой тканью для легкости. Фирменный стиль stripped away создает любимый стиль бега 90-х. Амортизация Nike Air обеспечивает длительный комфорт", "Кроссовки Nike Epic React Flyknit 3 с ярким дизайном, плавными линиями и легкой конструкцией выводят линейку на новый уровень. Легкий и долговечный пеноматериал Nike React отличается невероятной мягкостью и упругостью. При каждом шаге пеноматериал реагирует на давление, быстро возвращая исходную форму. Чем энергичнее шаг, тем больше возврат энергии. Легкий верх из эластичного материала Flyknit для вентиляции во время бега. Он повторяет форму стопы для поддержки при каждом шаге. Новая форма литой области пятки создана на основе отзывов бегунов", "Современный дизайн кроссовок выделяется четкими геометрическими линиями. Верх выполнен из сочетания искусственной кожи и сетчатого текстиля. Детали: инновационная подметка упруго пружинит. Упругая промежуточная подошва FuelFoam для амортизации. Детали: шнуровка, текстильная внутренняя отделка"]
   
    var price = ["21 999 ₽", "24 660 ₽"]
    var imageName = ["im1"]
    
    var body: some View {
        VStack {
            Text("")
        }
    }
}

struct ContentView_Previews: PreviewProvider {
    static var previews: some View {
        ContentView()
    }
}
